Revit 2027 API
ParameterTypeId.RoofCurveHeightAtWall Property
 "Plate Offset From Base"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofCurveHeightAtWall { get; }
Public Shared ReadOnly Property RoofCurveHeightAtWall As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofCurveHeightAtWall {
	ForgeTypeId^ get ();
}
static member RoofCurveHeightAtWall : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace